#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.key_vaults.azurerm_key_vault_key.op_app will be created
  + resource "azurerm_key_vault_key" "op_app" {
      + curve                   = (known after apply)
      + e                       = (known after apply)
      + id                      = (known after apply)
      + key_opts                = [
          + "sign",
        ]
      + key_size                = 2048
      + key_type                = "RSA"
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv"
      + n                       = (known after apply)
      + name                    = "op-app-key"
      + public_key_openssh      = (known after apply)
      + public_key_pem          = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + x                       = (known after apply)
      + y                       = (known after apply)
    }

  # module.web_apps.azurerm_role_assignment.key_vault_fims_op_app_secrets_user will be destroyed
  # (because azurerm_role_assignment.key_vault_fims_op_app_secrets_user is not in configuration)
  - resource "azurerm_role_assignment" "key_vault_fims_op_app_secrets_user" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv/providers/Microsoft.Authorization/roleAssignments/e69b3a50-fe16-6af6-4b90-f7a5df14abb5" -> null
      - name                 = "e69b3a50-fe16-6af6-4b90-f7a5df14abb5" -> null
      - principal_id         = "8a3cd137-692a-4693-8b09-77fcc550a64d" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> null
      - role_definition_name = "Key Vault Secrets User" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv" -> null
    }

  # module.web_apps.azurerm_role_assignment.key_vault_op_app["Key Vault Crypto User"] will be created
  + resource "azurerm_role_assignment" "key_vault_op_app" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8a3cd137-692a-4693-8b09-77fcc550a64d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.azurerm_role_assignment.key_vault_op_app["Key Vault Secrets User"] will be created
  + resource "azurerm_role_assignment" "key_vault_op_app" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8a3cd137-692a-4693-8b09-77fcc550a64d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-fims-rg/providers/Microsoft.KeyVault/vaults/io-p-fims-kv"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.module.op_app.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
      ~ app_settings                                   = {
          + "KEY_VAULT_KEY_NAME"                              = "op-app-key"
          + "KEY_VAULT_URL"                                   = "https://io-p-fims-kv.vault.azure.net/"
            # (18 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-weu-fims-rg-01/providers/Microsoft.Web/sites/io-p-weu-fims-op-app-01"
        name                                           = "io-p-weu-fims-op-app-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "Owner"                                          = "IO Comunicazione"
            "Source"                                         = "https://github.com/pagopa/io-fims/blob/main/infra/prod/westeurope"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.cosmos.module.comsosdb_sql_container_op_access_tokens.azurerm_cosmosdb_sql_container.this,
  on .terraform/modules/cosmos.comsosdb_sql_container_op_access_tokens/cosmosdb_sql_container/main.tf line 7, in resource "azurerm_cosmosdb_sql_container" "this":
   7:   partition_key_path = var.partition_key_path

`partition_key_path` will be removed in favour of the property
`partition_key_paths` in version 4.0 of the AzureRM Provider.

(and 14 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/cosmos.cosmosdb_account_fims/cosmosdb_account/output.tf line 54, in output "connection_strings":
  54:   value     = azurerm_cosmosdb_account.this.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
